MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
#define RPINR32 RPINR32
extern volatile uint16_t RPINR32 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR32BITS {
  union {
    struct {
      uint16_t SS4R:7;
    };
    struct {
      uint16_t SS4R0:1;
      uint16_t SS4R1:1;
      uint16_t SS4R2:1;
      uint16_t SS4R3:1;
      uint16_t SS4R4:1;
      uint16_t SS4R5:1;
      uint16_t SS4R6:1;
    };
  };
} RPINR32BITS;
extern volatile RPINR32BITS RPINR32bits __attribute__((__sfr__));

#define RPINR33 RPINR33
extern volatile uint16_t RPINR33 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR33BITS {
  union {
    struct {
      uint16_t IC9R:7;
      uint16_t :1;
      uint16_t IC10R:7;
    };
    struct {
      uint16_t IC9R0:1;
      uint16_t IC9R1:1;
      uint16_t IC9R2:1;
      uint16_t IC9R3:1;
      uint16_t IC9R4:1;
      uint16_t IC9R5:1;
      uint16_t IC9R6:1;
      uint16_t :1;
      uint16_t IC10R0:1;
      uint16_t IC10R1:1;
      uint16_t IC10R2:1;
      uint16_t IC10R3:1;
      uint16_t IC10R4:1;
      uint16_t IC10R5:1;
      uint16_t IC10R6:1;
    };
  };
} RPINR33BITS;
extern volatile RPINR33BITS RPINR33bits __attribute__((__sfr__));

#define RPINR34 RPINR34
extern volatile uint16_t RPINR34 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR34BITS {
  union {
    struct {
      uint16_t IC11R:7;
      uint16_t :1;
      uint16_t IC12R:7;
    };
    struct {
      uint16_t IC11R0:1;
      uint16_t IC11R1:1;
      uint16_t IC11R2:1;
      uint16_t IC11R3:1;
      uint16_t IC11R4:1;
      uint16_t IC11R5:1;
      uint16_t IC11R6:1;
      uint16_t :1;
      uint16_t IC12R0:1;
      uint16_t IC12R1:1;
      uint16_t IC12R2:1;
      uint16_t IC12R3:1;
      uint16_t IC12R4:1;
      uint16_t IC12R5:1;
      uint16_t IC12R6:1;
    };
  };
} RPINR34BITS;
extern volatile RPINR34BITS RPINR34bits __attribute__((__sfr__));

#define RPINR35 RPINR35
extern volatile uint16_t RPINR35 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR35BITS {
  union {
    struct {
      uint16_t IC13R:7;
      uint16_t :1;
      uint16_t IC14R:7;
    };
    struct {
      uint16_t IC13R0:1;
      uint16_t IC13R1:1;
      uint16_t IC13R2:1;
      uint16_t IC13R3:1;
      uint16_t IC13R4:1;
      uint16_t IC13R5:1;
      uint16_t IC13R6:1;
      uint16_t :1;
      uint16_t IC14R0:1;
      uint16_t IC14R1:1;
      uint16_t IC14R2:1;
      uint16_t IC14R3:1;
      uint16_t IC14R4:1;
      uint16_t IC14R5:1;
      uint16_t IC14R6:1;
    };
  };
} RPINR35BITS;
extern volatile RPINR35BITS RPINR35bits __attribute__((__sfr__));

#define RPINR36 RPINR36
extern volatile uint16_t RPINR36 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR36BITS {
  union {
    struct {
      uint16_t IC15R:7;
      uint16_t :1;
      uint16_t IC16R:7;
    };
    struct {
      uint16_t IC15R0:1;
      uint16_t IC15R1:1;
      uint16_t IC15R2:1;
      uint16_t IC15R3:1;
      uint16_t IC15R4:1;
      uint16_t IC15R5:1;
      uint16_t IC15R6:1;
      uint16_t :1;
      uint16_t IC16R0:1;
      uint16_t IC16R1:1;
      uint16_t IC16R2:1;
      uint16_t IC16R3:1;
      uint16_t IC16R4:1;
      uint16_t IC16R5:1;
      uint16_t IC16R6:1;
    };
  };
} RPINR36BITS;
extern volatile RPINR36BITS RPINR36bits __attribute__((__sfr__));

#define RPINR37 RPINR37
extern volatile uint16_t RPINR37 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR37BITS {
  union {
    struct {
      uint16_t OCFCR:7;
      uint16_t :1;
      uint16_t FLT5R:7;
    };
    struct {
      uint16_t OCFCR0:1;
      uint16_t OCFCR1:1;
      uint16_t OCFCR2:1;
      uint16_t OCFCR3:1;
      uint16_t OCFCR4:1;
      uint16_t OCFCR5:1;
      uint16_t OCFCR6:1;
      uint16_t :1;
      uint16_t FLT5R0:1;
      uint16_t FLT5R1:1;
      uint16_t FLT5R2:1;
      uint16_t FLT5R3:1;
      uint16_t FLT5R4:1;
      uint16_t FLT5R5:1;
      uint16_t FLT5R6:1;
    };
  };
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

#define RPINR38 RPINR38
extern volatile uint16_t RPINR38 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR38BITS {
  union {
    struct {
      uint16_t FLT6R:7;
      uint16_t :1;
      uint16_t FLT7R:7;
    };
    struct {
      uint16_t FLT6R0:1;
      uint16_t FLT6R1:1;
      uint16_t FLT6R2:1;
      uint16_t FLT6R3:1;
      uint16_t FLT6R4:1;
      uint16_t FLT6R5:1;
      uint16_t FLT6R6:1;
      uint16_t :1;
      uint16_t FLT7R0:1;
      uint16_t FLT7R1:1;
      uint16_t FLT7R2:1;
      uint16_t FLT7R3:1;
      uint16_t FLT7R4:1;
      uint16_t FLT7R5:1;
      uint16_t FLT7R6:1;
    };
  };
} RPINR38BITS;
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

#define RPINR40 RPINR40
extern volatile uint16_t RPINR40 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR40BITS {
  union {
    struct {
      uint16_t DTCMP1R:7;
      uint16_t :1;
      uint16_t DTCMP2R:7;
    };
    struct {
      uint16_t DTCMP1R0:1;
      uint16_t DTCMP1R1:1;
      uint16_t DTCMP1R2:1;
      uint16_t DTCMP1R3:1;
      uint16_t DTCMP1R4:1;
      uint16_t DTCMP1R5:1;
      uint16_t DTCMP1R6:1;
      uint16_t :1;
      uint16_t DTCMP2R0:1;
      uint16_t DTCMP2R1:1;
      uint16_t DTCMP2R2:1;
      uint16_t DTCMP2R3:1;
      uint16_t DTCMP2R4:1;
      uint16_t DTCMP2R5:1;
      uint16_t DTCMP2R6:1;
    };
  };
} RPINR40BITS;
extern volatile RPINR40BITS RPINR40bits __attribute__((__sfr__));

#define RPINR41 RPINR41
extern volatile uint16_t RPINR41 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR41BITS {
  union {
    struct {
      uint16_t DTCMP3R:7;
      uint16_t :1;
      uint16_t DTCMP4R:7;
    };
    struct {
      uint16_t DTCMP3R0:1;
      uint16_t DTCMP3R1:1;
      uint16_t DTCMP3R2:1;
      uint16_t DTCMP3R3:1;
      uint16_t DTCMP3R4:1;
      uint16_t DTCMP3R5:1;
      uint16_t DTCMP3R6:1;
      uint16_t :1;
      uint16_t DTCMP4R0:1;
      uint16_t DTCMP4R1:1;
      uint16_t DTCMP4R2:1;
      uint16_t DTCMP4R3:1;
      uint16_t DTCMP4R4:1;
      uint16_t DTCMP4R5:1;
      uint16_t DTCMP4R6:1;
    };
  };
} RPINR41BITS;
extern volatile RPINR41BITS RPINR41bits __attribute__((__sfr__));

#define RPINR42 RPINR42
extern volatile uint16_t RPINR42 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR42BITS {
  union {
    struct {
      uint16_t DTCMP5R:7;
      uint16_t :1;
      uint16_t DTCMP6R:7;
    };
    struct {
      uint16_t DTCMP5R0:1;
      uint16_t DTCMP5R1:1;
      uint16_t DTCMP5R2:1;
      uint16_t DTCMP5R3:1;
      uint16_t DTCMP5R4:1;
      uint16_t DTCMP5R5:1;
      uint16_t DTCMP5R6:1;
      uint16_t :1;
      uint16_t DTCMP6R0:1;
      uint16_t DTCMP6R1:1;
      uint16_t DTCMP6R2:1;
      uint16_t DTCMP6R3:1;
      uint16_t DTCMP6R4:1;
      uint16_t DTCMP6R5:1;
      uint16_t DTCMP6R6:1;
    };
  };
} RPINR42BITS;
