MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
extern volatile DMA7STBHBITS DMA7STBHbits __attribute__((__sfr__));

#define DMA7PAD DMA7PAD
extern volatile uint16_t DMA7PAD __attribute__((__sfr__));
#define DMA7CNT DMA7CNT
extern volatile uint16_t DMA7CNT __attribute__((__sfr__));
typedef struct tagDMA7CNTBITS {
  uint16_t CNT:14;
} DMA7CNTBITS;
extern volatile DMA7CNTBITS DMA7CNTbits __attribute__((__sfr__));

#define DMA8CON DMA8CON
extern volatile uint16_t DMA8CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA8CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA8CONBITS;
extern volatile DMA8CONBITS DMA8CONbits __attribute__((__sfr__));

#define DMA8REQ DMA8REQ
extern volatile uint16_t DMA8REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA8REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA8REQBITS;
extern volatile DMA8REQBITS DMA8REQbits __attribute__((__sfr__));

#define DMA8STAL DMA8STAL
extern volatile uint16_t DMA8STAL __attribute__((__sfr__));
#define DMA8STAH DMA8STAH
extern volatile uint16_t DMA8STAH __attribute__((__sfr__));
typedef struct tagDMA8STAHBITS {
  uint16_t STA:8;
} DMA8STAHBITS;
extern volatile DMA8STAHBITS DMA8STAHbits __attribute__((__sfr__));

#define DMA8STBL DMA8STBL
extern volatile uint16_t DMA8STBL __attribute__((__sfr__));
#define DMA8STBH DMA8STBH
extern volatile uint16_t DMA8STBH __attribute__((__sfr__));
typedef struct tagDMA8STBHBITS {
  uint16_t STB:8;
} DMA8STBHBITS;
extern volatile DMA8STBHBITS DMA8STBHbits __attribute__((__sfr__));

#define DMA8PAD DMA8PAD
extern volatile uint16_t DMA8PAD __attribute__((__sfr__));
#define DMA8CNT DMA8CNT
extern volatile uint16_t DMA8CNT __attribute__((__sfr__));
typedef struct tagDMA8CNTBITS {
  uint16_t CNT:14;
} DMA8CNTBITS;
extern volatile DMA8CNTBITS DMA8CNTbits __attribute__((__sfr__));

#define DMA9CON DMA9CON
extern volatile uint16_t DMA9CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA9CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA9CONBITS;
extern volatile DMA9CONBITS DMA9CONbits __attribute__((__sfr__));

#define DMA9REQ DMA9REQ
extern volatile uint16_t DMA9REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA9REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA9REQBITS;
extern volatile DMA9REQBITS DMA9REQbits __attribute__((__sfr__));

#define DMA9STAL DMA9STAL
extern volatile uint16_t DMA9STAL __attribute__((__sfr__));
#define DMA9STAH DMA9STAH
extern volatile uint16_t DMA9STAH __attribute__((__sfr__));
typedef struct tagDMA9STAHBITS {
  uint16_t STA:8;
} DMA9STAHBITS;
extern volatile DMA9STAHBITS DMA9STAHbits __attribute__((__sfr__));

#define DMA9STBL DMA9STBL
extern volatile uint16_t DMA9STBL __attribute__((__sfr__));
#define DMA9STBH DMA9STBH
extern volatile uint16_t DMA9STBH __attribute__((__sfr__));
typedef struct tagDMA9STBHBITS {
  uint16_t STB:8;
} DMA9STBHBITS;
extern volatile DMA9STBHBITS DMA9STBHbits __attribute__((__sfr__));

#define DMA9PAD DMA9PAD
extern volatile uint16_t DMA9PAD __attribute__((__sfr__));
#define DMA9CNT DMA9CNT
extern volatile uint16_t DMA9CNT __attribute__((__sfr__));
typedef struct tagDMA9CNTBITS {
  uint16_t CNT:14;
} DMA9CNTBITS;
extern volatile DMA9CNTBITS DMA9CNTbits __attribute__((__sfr__));

#define DMA10CON DMA10CON
extern volatile uint16_t DMA10CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA10CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA10CONBITS;
extern volatile DMA10CONBITS DMA10CONbits __attribute__((__sfr__));

#define DMA10REQ DMA10REQ
extern volatile uint16_t DMA10REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA10REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA10REQBITS;
extern volatile DMA10REQBITS DMA10REQbits __attribute__((__sfr__));

#define DMA10STAL DMA10STAL
extern volatile uint16_t DMA10STAL __attribute__((__sfr__));
#define DMA10STAH DMA10STAH
extern volatile uint16_t DMA10STAH __attribute__((__sfr__));
typedef struct tagDMA10STAHBITS {
  uint16_t STA:8;
} DMA10STAHBITS;
extern volatile DMA10STAHBITS DMA10STAHbits __attribute__((__sfr__));

#define DMA10STBL DMA10STBL
extern volatile uint16_t DMA10STBL __attribute__((__sfr__));
#define DMA10STBH DMA10STBH
extern volatile uint16_t DMA10STBH __attribute__((__sfr__));
typedef struct tagDMA10STBHBITS {
  uint16_t STB:8;
} DMA10STBHBITS;
