MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
#define CNPDJ CNPDJ
extern volatile uint16_t CNPDJ __attribute__((__sfr__));
typedef struct tagCNPDJBITS {
  uint16_t CNPDJ0:1;
  uint16_t CNPDJ1:1;
  uint16_t CNPDJ2:1;
  uint16_t CNPDJ3:1;
  uint16_t CNPDJ4:1;
  uint16_t CNPDJ5:1;
  uint16_t CNPDJ6:1;
  uint16_t CNPDJ7:1;
  uint16_t CNPDJ8:1;
  uint16_t CNPDJ9:1;
  uint16_t CNPDJ10:1;
  uint16_t CNPDJ11:1;
  uint16_t CNPDJ12:1;
  uint16_t CNPDJ13:1;
  uint16_t CNPDJ14:1;
  uint16_t CNPDJ15:1;
} CNPDJBITS;
extern volatile CNPDJBITS CNPDJbits __attribute__((__sfr__));

#define TRISK TRISK
extern volatile uint16_t TRISK __attribute__((__sfr__));
typedef struct tagTRISKBITS {
  uint16_t TRISK0:1;
  uint16_t TRISK1:1;
  uint16_t :9;
  uint16_t TRISK11:1;
  uint16_t TRISK12:1;
  uint16_t TRISK13:1;
  uint16_t TRISK14:1;
  uint16_t TRISK15:1;
} TRISKBITS;
extern volatile TRISKBITS TRISKbits __attribute__((__sfr__));

#define PORTK PORTK
extern volatile uint16_t PORTK __attribute__((__sfr__));
typedef struct tagPORTKBITS {
  uint16_t RK0:1;
  uint16_t RK1:1;
  uint16_t :9;
  uint16_t RK11:1;
  uint16_t RK12:1;
  uint16_t RK13:1;
  uint16_t RK14:1;
  uint16_t RK15:1;
} PORTKBITS;
extern volatile PORTKBITS PORTKbits __attribute__((__sfr__));

#define LATK LATK
extern volatile uint16_t LATK __attribute__((__sfr__));
typedef struct tagLATKBITS {
  uint16_t LATK0:1;
  uint16_t LATK1:1;
  uint16_t :9;
  uint16_t LATK11:1;
  uint16_t LATK12:1;
  uint16_t LATK13:1;
  uint16_t LATK14:1;
  uint16_t LATK15:1;
} LATKBITS;
extern volatile LATKBITS LATKbits __attribute__((__sfr__));

#define ODCK ODCK
extern volatile uint16_t ODCK __attribute__((__sfr__));
typedef struct tagODCKBITS {
  uint16_t ODCK0:1;
  uint16_t ODCK1:1;
  uint16_t :9;
  uint16_t ODCK11:1;
  uint16_t ODCK12:1;
  uint16_t ODCK13:1;
  uint16_t ODCK14:1;
  uint16_t ODCK15:1;
} ODCKBITS;
extern volatile ODCKBITS ODCKbits __attribute__((__sfr__));

#define CNENK CNENK
extern volatile uint16_t CNENK __attribute__((__sfr__));
typedef struct tagCNENKBITS {
  uint16_t CNIEK0:1;
  uint16_t CNIEK1:1;
  uint16_t :9;
  uint16_t CNIEK11:1;
  uint16_t CNIEK12:1;
  uint16_t CNIEK13:1;
  uint16_t CNIEK14:1;
  uint16_t CNIEK15:1;
} CNENKBITS;
extern volatile CNENKBITS CNENKbits __attribute__((__sfr__));

#define CNPUK CNPUK
extern volatile uint16_t CNPUK __attribute__((__sfr__));
typedef struct tagCNPUKBITS {
  uint16_t CNPUK0:1;
  uint16_t CNPUK1:1;
  uint16_t :9;
  uint16_t CNPUK11:1;
  uint16_t CNPUK12:1;
  uint16_t CNPUK13:1;
  uint16_t CNPUK14:1;
  uint16_t CNPUK15:1;
} CNPUKBITS;
extern volatile CNPUKBITS CNPUKbits __attribute__((__sfr__));

#define CNPDK CNPDK
extern volatile uint16_t CNPDK __attribute__((__sfr__));
typedef struct tagCNPDKBITS {
  uint16_t CNPDK0:1;
  uint16_t CNPDK1:1;
  uint16_t :9;
  uint16_t CNPDK11:1;
  uint16_t CNPDK12:1;
  uint16_t CNPDK13:1;
  uint16_t CNPDK14:1;
  uint16_t CNPDK15:1;
} CNPDKBITS;
extern volatile CNPDKBITS CNPDKbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile uint16_t PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  uint16_t PMPTTL:1;
  uint16_t RTSECSEL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

#define _APPO _APPO
extern volatile uint16_t _APPO __attribute__((__sfr__));
#define _APPIN _APPIN
extern volatile uint16_t _APPIN __attribute__((__sfr__));
#define APPS APPS
extern volatile uint16_t APPS __attribute__((__sfr__));
typedef struct tagAPPSBITS {
  uint16_t APIFUL:1;
  uint16_t APIOV:1;
  uint16_t APOFUL:1;
  uint16_t APOOV:1;
  uint16_t STRFUL:1;
} APPSBITS;
extern volatile APPSBITS APPSbits __attribute__((__sfr__));

#define STROUTL STROUTL
extern volatile uint16_t STROUTL __attribute__((__sfr__));
#define STROUTH STROUTH
extern volatile uint16_t STROUTH __attribute__((__sfr__));
#define STROVCNT STROVCNT
extern volatile uint16_t STROVCNT __attribute__((__sfr__));


/* ---------------------------------------------------------- */
/* Defines for unique SFR bit names                           */
/* ---------------------------------------------------------- */

/* DSRPAG */
#define _DSRPAG DSRPAGbits.DSRPAG

/* DSWPAG */
#define _DSWPAG DSWPAGbits.DSWPAG

/* SR */
#define _C SRbits.C
#define _Z SRbits.Z
#define _OV SRbits.OV
#define _N SRbits.N
#define _RA SRbits.RA
#define _IPL SRbits.IPL
/* Bitname _DC cannot be defined because it is used by more than one SFR */
#define _IPL0 SRbits.IPL0
#define _IPL1 SRbits.IPL1
#define _IPL2 SRbits.IPL2

/* CORCON */
#define _SFA CORCONbits.SFA
#define _IPL3 CORCONbits.IPL3
#define _VAR CORCONbits.VAR

/* TBLPAG */
#define _TBLPAG TBLPAGbits.TBLPAG

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1

/* T2CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T3CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T4CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T5CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T6CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T7CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T8CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* T9CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* IC1CON1 */
/* Bitname _ICM cannot be defined because it is used by more than one SFR */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICI cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ICM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICM2 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICI1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICTSEL2 cannot be defined because it is used by more than one SFR */

/* IC1CON2 */
/* Bitname _SYNCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _ICTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _IC32 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNCSEL4 cannot be defined because it is used by more than one SFR */

