MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
/* RPINR14 */
#define _QEA1R RPINR14bits.QEA1R
#define _QEB1R RPINR14bits.QEB1R
#define _QEA1R0 RPINR14bits.QEA1R0
#define _QEA1R1 RPINR14bits.QEA1R1
#define _QEA1R2 RPINR14bits.QEA1R2
#define _QEA1R3 RPINR14bits.QEA1R3
#define _QEA1R4 RPINR14bits.QEA1R4
#define _QEA1R5 RPINR14bits.QEA1R5
#define _QEA1R6 RPINR14bits.QEA1R6
#define _QEB1R0 RPINR14bits.QEB1R0
#define _QEB1R1 RPINR14bits.QEB1R1
#define _QEB1R2 RPINR14bits.QEB1R2
#define _QEB1R3 RPINR14bits.QEB1R3
#define _QEB1R4 RPINR14bits.QEB1R4
#define _QEB1R5 RPINR14bits.QEB1R5
#define _QEB1R6 RPINR14bits.QEB1R6

/* RPINR15 */
#define _INDX1R RPINR15bits.INDX1R
#define _HOME1R RPINR15bits.HOME1R
#define _INDX1R0 RPINR15bits.INDX1R0
#define _INDX1R1 RPINR15bits.INDX1R1
#define _INDX1R2 RPINR15bits.INDX1R2
#define _INDX1R3 RPINR15bits.INDX1R3
#define _INDX1R4 RPINR15bits.INDX1R4
#define _INDX1R5 RPINR15bits.INDX1R5
#define _INDX1R6 RPINR15bits.INDX1R6
#define _HOME1R0 RPINR15bits.HOME1R0
#define _HOME1R1 RPINR15bits.HOME1R1
#define _HOME1R2 RPINR15bits.HOME1R2
#define _HOME1R3 RPINR15bits.HOME1R3
#define _HOME1R4 RPINR15bits.HOME1R4
#define _HOME1R5 RPINR15bits.HOME1R5
#define _HOME1R6 RPINR15bits.HOME1R6

/* RPINR16 */
#define _QEA2R RPINR16bits.QEA2R
#define _QEB2R RPINR16bits.QEB2R
#define _QEA2R0 RPINR16bits.QEA2R0
#define _QEA2R1 RPINR16bits.QEA2R1
#define _QEA2R2 RPINR16bits.QEA2R2
#define _QEA2R3 RPINR16bits.QEA2R3
#define _QEA2R4 RPINR16bits.QEA2R4
#define _QEA2R5 RPINR16bits.QEA2R5
#define _QEA2R6 RPINR16bits.QEA2R6
#define _QEB2R0 RPINR16bits.QEB2R0
#define _QEB2R1 RPINR16bits.QEB2R1
#define _QEB2R2 RPINR16bits.QEB2R2
#define _QEB2R3 RPINR16bits.QEB2R3
#define _QEB2R4 RPINR16bits.QEB2R4
#define _QEB2R5 RPINR16bits.QEB2R5
#define _QEB2R6 RPINR16bits.QEB2R6

/* RPINR17 */
#define _INDX2R RPINR17bits.INDX2R
#define _HOME2R RPINR17bits.HOME2R
#define _INDX2R0 RPINR17bits.INDX2R0
#define _INDX2R1 RPINR17bits.INDX2R1
#define _INDX2R2 RPINR17bits.INDX2R2
#define _INDX2R3 RPINR17bits.INDX2R3
#define _INDX2R4 RPINR17bits.INDX2R4
#define _INDX2R5 RPINR17bits.INDX2R5
#define _INDX2R6 RPINR17bits.INDX2R6
#define _HOME2R0 RPINR17bits.HOME2R0
#define _HOME2R1 RPINR17bits.HOME2R1
#define _HOME2R2 RPINR17bits.HOME2R2
#define _HOME2R3 RPINR17bits.HOME2R3
#define _HOME2R4 RPINR17bits.HOME2R4
#define _HOME2R5 RPINR17bits.HOME2R5
#define _HOME2R6 RPINR17bits.HOME2R6

/* RPINR18 */
#define _U1RXR RPINR18bits.U1RXR
#define _U1CTSR RPINR18bits.U1CTSR
#define _U1RXR0 RPINR18bits.U1RXR0
#define _U1RXR1 RPINR18bits.U1RXR1
#define _U1RXR2 RPINR18bits.U1RXR2
#define _U1RXR3 RPINR18bits.U1RXR3
#define _U1RXR4 RPINR18bits.U1RXR4
#define _U1RXR5 RPINR18bits.U1RXR5
#define _U1RXR6 RPINR18bits.U1RXR6
#define _U1CTSR0 RPINR18bits.U1CTSR0
#define _U1CTSR1 RPINR18bits.U1CTSR1
#define _U1CTSR2 RPINR18bits.U1CTSR2
#define _U1CTSR3 RPINR18bits.U1CTSR3
#define _U1CTSR4 RPINR18bits.U1CTSR4
#define _U1CTSR5 RPINR18bits.U1CTSR5
#define _U1CTSR6 RPINR18bits.U1CTSR6

/* RPINR19 */
#define _U2RXR RPINR19bits.U2RXR
#define _U2CTSR RPINR19bits.U2CTSR
#define _U2RXR0 RPINR19bits.U2RXR0
#define _U2RXR1 RPINR19bits.U2RXR1
#define _U2RXR2 RPINR19bits.U2RXR2
#define _U2RXR3 RPINR19bits.U2RXR3
#define _U2RXR4 RPINR19bits.U2RXR4
#define _U2RXR5 RPINR19bits.U2RXR5
#define _U2RXR6 RPINR19bits.U2RXR6
#define _U2CTSR0 RPINR19bits.U2CTSR0
#define _U2CTSR1 RPINR19bits.U2CTSR1
#define _U2CTSR2 RPINR19bits.U2CTSR2
#define _U2CTSR3 RPINR19bits.U2CTSR3
#define _U2CTSR4 RPINR19bits.U2CTSR4
#define _U2CTSR5 RPINR19bits.U2CTSR5
#define _U2CTSR6 RPINR19bits.U2CTSR6

/* RPINR20 */
#define _SDI1R RPINR20bits.SDI1R
#define _SCK1R RPINR20bits.SCK1R
#define _SDI1R0 RPINR20bits.SDI1R0
#define _SDI1R1 RPINR20bits.SDI1R1
#define _SDI1R2 RPINR20bits.SDI1R2
#define _SDI1R3 RPINR20bits.SDI1R3
#define _SDI1R4 RPINR20bits.SDI1R4
#define _SDI1R5 RPINR20bits.SDI1R5
#define _SDI1R6 RPINR20bits.SDI1R6
#define _SCK1R0 RPINR20bits.SCK1R0
#define _SCK1R1 RPINR20bits.SCK1R1
#define _SCK1R2 RPINR20bits.SCK1R2
#define _SCK1R3 RPINR20bits.SCK1R3
#define _SCK1R4 RPINR20bits.SCK1R4
#define _SCK1R5 RPINR20bits.SCK1R5
#define _SCK1R6 RPINR20bits.SCK1R6

/* RPINR21 */
#define _SS1R RPINR21bits.SS1R
#define _SS1R0 RPINR21bits.SS1R0
#define _SS1R1 RPINR21bits.SS1R1
#define _SS1R2 RPINR21bits.SS1R2
#define _SS1R3 RPINR21bits.SS1R3
#define _SS1R4 RPINR21bits.SS1R4
#define _SS1R5 RPINR21bits.SS1R5
#define _SS1R6 RPINR21bits.SS1R6

/* RPINR23 */
#define _SS2R RPINR23bits.SS2R
#define _SS2R0 RPINR23bits.SS2R0
#define _SS2R1 RPINR23bits.SS2R1
#define _SS2R2 RPINR23bits.SS2R2
#define _SS2R3 RPINR23bits.SS2R3
#define _SS2R4 RPINR23bits.SS2R4
#define _SS2R5 RPINR23bits.SS2R5
#define _SS2R6 RPINR23bits.SS2R6

/* RPINR24 */
#define _CSDIR RPINR24bits.CSDIR
#define _CSCKR RPINR24bits.CSCKR
#define _CSDIR0 RPINR24bits.CSDIR0
#define _CSDIR1 RPINR24bits.CSDIR1
#define _CSDIR2 RPINR24bits.CSDIR2
#define _CSDIR3 RPINR24bits.CSDIR3
#define _CSDIR4 RPINR24bits.CSDIR4
#define _CSDIR5 RPINR24bits.CSDIR5
#define _CSDIR6 RPINR24bits.CSDIR6
#define _CSCKR0 RPINR24bits.CSCKR0
#define _CSCKR1 RPINR24bits.CSCKR1
#define _CSCKR2 RPINR24bits.CSCKR2
#define _CSCKR3 RPINR24bits.CSCKR3
#define _CSCKR4 RPINR24bits.CSCKR4
#define _CSCKR5 RPINR24bits.CSCKR5
#define _CSCKR6 RPINR24bits.CSCKR6

/* RPINR25 */
#define _COFSR RPINR25bits.COFSR
#define _COFSR0 RPINR25bits.COFSR0
#define _COFSR1 RPINR25bits.COFSR1
#define _COFSR2 RPINR25bits.COFSR2
#define _COFSR3 RPINR25bits.COFSR3
#define _COFSR4 RPINR25bits.COFSR4
#define _COFSR5 RPINR25bits.COFSR5
#define _COFSR6 RPINR25bits.COFSR6

/* RPINR26 */
#define _C1RXR RPINR26bits.C1RXR
#define _C2RXR RPINR26bits.C2RXR
#define _C1RXR0 RPINR26bits.C1RXR0
#define _C1RXR1 RPINR26bits.C1RXR1
#define _C1RXR2 RPINR26bits.C1RXR2
#define _C1RXR3 RPINR26bits.C1RXR3
#define _C1RXR4 RPINR26bits.C1RXR4
#define _C1RXR5 RPINR26bits.C1RXR5
#define _C1RXR6 RPINR26bits.C1RXR6
#define _C2RXR0 RPINR26bits.C2RXR0
#define _C2RXR1 RPINR26bits.C2RXR1
#define _C2RXR2 RPINR26bits.C2RXR2
#define _C2RXR3 RPINR26bits.C2RXR3
#define _C2RXR4 RPINR26bits.C2RXR4
#define _C2RXR5 RPINR26bits.C2RXR5
#define _C2RXR6 RPINR26bits.C2RXR6

/* RPINR27 */
#define _U3RXR RPINR27bits.U3RXR
#define _U3CTSR RPINR27bits.U3CTSR
#define _U3RXR0 RPINR27bits.U3RXR0
#define _U3RXR1 RPINR27bits.U3RXR1
#define _U3RXR2 RPINR27bits.U3RXR2
#define _U3RXR3 RPINR27bits.U3RXR3
#define _U3RXR4 RPINR27bits.U3RXR4
#define _U3RXR5 RPINR27bits.U3RXR5
#define _U3RXR6 RPINR27bits.U3RXR6
#define _U3CTSR0 RPINR27bits.U3CTSR0
#define _U3CTSR1 RPINR27bits.U3CTSR1
#define _U3CTSR2 RPINR27bits.U3CTSR2
#define _U3CTSR3 RPINR27bits.U3CTSR3
#define _U3CTSR4 RPINR27bits.U3CTSR4
#define _U3CTSR5 RPINR27bits.U3CTSR5
#define _U3CTSR6 RPINR27bits.U3CTSR6

