MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
#define _RPINR34_IC11R3_POSITION                 0x00000003
#define _RPINR34_IC11R3_MASK                     0x00000008
#define _RPINR34_IC11R3_LENGTH                   0x00000001

#define _RPINR34_IC11R4_POSITION                 0x00000004
#define _RPINR34_IC11R4_MASK                     0x00000010
#define _RPINR34_IC11R4_LENGTH                   0x00000001

#define _RPINR34_IC11R5_POSITION                 0x00000005
#define _RPINR34_IC11R5_MASK                     0x00000020
#define _RPINR34_IC11R5_LENGTH                   0x00000001

#define _RPINR34_IC11R6_POSITION                 0x00000006
#define _RPINR34_IC11R6_MASK                     0x00000040
#define _RPINR34_IC11R6_LENGTH                   0x00000001

#define _RPINR34_IC12R0_POSITION                 0x00000008
#define _RPINR34_IC12R0_MASK                     0x00000100
#define _RPINR34_IC12R0_LENGTH                   0x00000001

#define _RPINR34_IC12R1_POSITION                 0x00000009
#define _RPINR34_IC12R1_MASK                     0x00000200
#define _RPINR34_IC12R1_LENGTH                   0x00000001

#define _RPINR34_IC12R2_POSITION                 0x0000000A
#define _RPINR34_IC12R2_MASK                     0x00000400
#define _RPINR34_IC12R2_LENGTH                   0x00000001

#define _RPINR34_IC12R3_POSITION                 0x0000000B
#define _RPINR34_IC12R3_MASK                     0x00000800
#define _RPINR34_IC12R3_LENGTH                   0x00000001

#define _RPINR34_IC12R4_POSITION                 0x0000000C
#define _RPINR34_IC12R4_MASK                     0x00001000
#define _RPINR34_IC12R4_LENGTH                   0x00000001

#define _RPINR34_IC12R5_POSITION                 0x0000000D
#define _RPINR34_IC12R5_MASK                     0x00002000
#define _RPINR34_IC12R5_LENGTH                   0x00000001

#define _RPINR34_IC12R6_POSITION                 0x0000000E
#define _RPINR34_IC12R6_MASK                     0x00004000
#define _RPINR34_IC12R6_LENGTH                   0x00000001

#define _RPINR35_IC13R_POSITION                  0x00000000
#define _RPINR35_IC13R_MASK                      0x0000007F
#define _RPINR35_IC13R_LENGTH                    0x00000007

#define _RPINR35_IC14R_POSITION                  0x00000008
#define _RPINR35_IC14R_MASK                      0x00007F00
#define _RPINR35_IC14R_LENGTH                    0x00000007

#define _RPINR35_IC13R0_POSITION                 0x00000000
#define _RPINR35_IC13R0_MASK                     0x00000001
#define _RPINR35_IC13R0_LENGTH                   0x00000001

#define _RPINR35_IC13R1_POSITION                 0x00000001
#define _RPINR35_IC13R1_MASK                     0x00000002
#define _RPINR35_IC13R1_LENGTH                   0x00000001

#define _RPINR35_IC13R2_POSITION                 0x00000002
#define _RPINR35_IC13R2_MASK                     0x00000004
#define _RPINR35_IC13R2_LENGTH                   0x00000001

#define _RPINR35_IC13R3_POSITION                 0x00000003
#define _RPINR35_IC13R3_MASK                     0x00000008
#define _RPINR35_IC13R3_LENGTH                   0x00000001

#define _RPINR35_IC13R4_POSITION                 0x00000004
#define _RPINR35_IC13R4_MASK                     0x00000010
#define _RPINR35_IC13R4_LENGTH                   0x00000001

#define _RPINR35_IC13R5_POSITION                 0x00000005
#define _RPINR35_IC13R5_MASK                     0x00000020
#define _RPINR35_IC13R5_LENGTH                   0x00000001

#define _RPINR35_IC13R6_POSITION                 0x00000006
#define _RPINR35_IC13R6_MASK                     0x00000040
#define _RPINR35_IC13R6_LENGTH                   0x00000001

#define _RPINR35_IC14R0_POSITION                 0x00000008
#define _RPINR35_IC14R0_MASK                     0x00000100
#define _RPINR35_IC14R0_LENGTH                   0x00000001

#define _RPINR35_IC14R1_POSITION                 0x00000009
#define _RPINR35_IC14R1_MASK                     0x00000200
#define _RPINR35_IC14R1_LENGTH                   0x00000001

#define _RPINR35_IC14R2_POSITION                 0x0000000A
#define _RPINR35_IC14R2_MASK                     0x00000400
#define _RPINR35_IC14R2_LENGTH                   0x00000001

#define _RPINR35_IC14R3_POSITION                 0x0000000B
#define _RPINR35_IC14R3_MASK                     0x00000800
#define _RPINR35_IC14R3_LENGTH                   0x00000001

#define _RPINR35_IC14R4_POSITION                 0x0000000C
#define _RPINR35_IC14R4_MASK                     0x00001000
#define _RPINR35_IC14R4_LENGTH                   0x00000001

#define _RPINR35_IC14R5_POSITION                 0x0000000D
#define _RPINR35_IC14R5_MASK                     0x00002000
#define _RPINR35_IC14R5_LENGTH                   0x00000001

#define _RPINR35_IC14R6_POSITION                 0x0000000E
#define _RPINR35_IC14R6_MASK                     0x00004000
#define _RPINR35_IC14R6_LENGTH                   0x00000001

#define _RPINR36_IC15R_POSITION                  0x00000000
#define _RPINR36_IC15R_MASK                      0x0000007F
#define _RPINR36_IC15R_LENGTH                    0x00000007

#define _RPINR36_IC16R_POSITION                  0x00000008
#define _RPINR36_IC16R_MASK                      0x00007F00
#define _RPINR36_IC16R_LENGTH                    0x00000007

#define _RPINR36_IC15R0_POSITION                 0x00000000
#define _RPINR36_IC15R0_MASK                     0x00000001
#define _RPINR36_IC15R0_LENGTH                   0x00000001

#define _RPINR36_IC15R1_POSITION                 0x00000001
#define _RPINR36_IC15R1_MASK                     0x00000002
#define _RPINR36_IC15R1_LENGTH                   0x00000001

#define _RPINR36_IC15R2_POSITION                 0x00000002
#define _RPINR36_IC15R2_MASK                     0x00000004
#define _RPINR36_IC15R2_LENGTH                   0x00000001

#define _RPINR36_IC15R3_POSITION                 0x00000003
#define _RPINR36_IC15R3_MASK                     0x00000008
#define _RPINR36_IC15R3_LENGTH                   0x00000001

#define _RPINR36_IC15R4_POSITION                 0x00000004
#define _RPINR36_IC15R4_MASK                     0x00000010
#define _RPINR36_IC15R4_LENGTH                   0x00000001

