MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
#define _IPC22_U4RXIP0_POSITION                  0x00000000
#define _IPC22_U4RXIP0_MASK                      0x00000001
#define _IPC22_U4RXIP0_LENGTH                    0x00000001

#define _IPC22_U4RXIP1_POSITION                  0x00000001
#define _IPC22_U4RXIP1_MASK                      0x00000002
#define _IPC22_U4RXIP1_LENGTH                    0x00000001

#define _IPC22_U4RXIP2_POSITION                  0x00000002
#define _IPC22_U4RXIP2_MASK                      0x00000004
#define _IPC22_U4RXIP2_LENGTH                    0x00000001

#define _IPC22_U4TXIP0_POSITION                  0x00000004
#define _IPC22_U4TXIP0_MASK                      0x00000010
#define _IPC22_U4TXIP0_LENGTH                    0x00000001

#define _IPC22_U4TXIP1_POSITION                  0x00000005
#define _IPC22_U4TXIP1_MASK                      0x00000020
#define _IPC22_U4TXIP1_LENGTH                    0x00000001

#define _IPC22_U4TXIP2_POSITION                  0x00000006
#define _IPC22_U4TXIP2_MASK                      0x00000040
#define _IPC22_U4TXIP2_LENGTH                    0x00000001

#define _IPC22_SPI3EIP0_POSITION                 0x00000008
#define _IPC22_SPI3EIP0_MASK                     0x00000100
#define _IPC22_SPI3EIP0_LENGTH                   0x00000001

#define _IPC22_SPI3EIP1_POSITION                 0x00000009
#define _IPC22_SPI3EIP1_MASK                     0x00000200
#define _IPC22_SPI3EIP1_LENGTH                   0x00000001

#define _IPC22_SPI3EIP2_POSITION                 0x0000000A
#define _IPC22_SPI3EIP2_MASK                     0x00000400
#define _IPC22_SPI3EIP2_LENGTH                   0x00000001

#define _IPC22_SPI3IP0_POSITION                  0x0000000C
#define _IPC22_SPI3IP0_MASK                      0x00001000
#define _IPC22_SPI3IP0_LENGTH                    0x00000001

#define _IPC22_SPI3IP1_POSITION                  0x0000000D
#define _IPC22_SPI3IP1_MASK                      0x00002000
#define _IPC22_SPI3IP1_LENGTH                    0x00000001

#define _IPC22_SPI3IP2_POSITION                  0x0000000E
#define _IPC22_SPI3IP2_MASK                      0x00004000
#define _IPC22_SPI3IP2_LENGTH                    0x00000001

#define _IPC23_OC9IP_POSITION                    0x00000000
#define _IPC23_OC9IP_MASK                        0x00000007
#define _IPC23_OC9IP_LENGTH                      0x00000003

#define _IPC23_IC9IP_POSITION                    0x00000004
#define _IPC23_IC9IP_MASK                        0x00000070
#define _IPC23_IC9IP_LENGTH                      0x00000003

#define _IPC23_OC9IP0_POSITION                   0x00000000
#define _IPC23_OC9IP0_MASK                       0x00000001
#define _IPC23_OC9IP0_LENGTH                     0x00000001

#define _IPC23_OC9IP1_POSITION                   0x00000001
#define _IPC23_OC9IP1_MASK                       0x00000002
#define _IPC23_OC9IP1_LENGTH                     0x00000001

#define _IPC23_OC9IP2_POSITION                   0x00000002
#define _IPC23_OC9IP2_MASK                       0x00000004
#define _IPC23_OC9IP2_LENGTH                     0x00000001

#define _IPC23_IC9IP0_POSITION                   0x00000004
#define _IPC23_IC9IP0_MASK                       0x00000010
#define _IPC23_IC9IP0_LENGTH                     0x00000001

#define _IPC23_IC9IP1_POSITION                   0x00000005
#define _IPC23_IC9IP1_MASK                       0x00000020
#define _IPC23_IC9IP1_LENGTH                     0x00000001

#define _IPC23_IC9IP2_POSITION                   0x00000006
#define _IPC23_IC9IP2_MASK                       0x00000040
#define _IPC23_IC9IP2_LENGTH                     0x00000001

#define _IPC29_DMA8IP_POSITION                   0x00000008
#define _IPC29_DMA8IP_MASK                       0x00000700
#define _IPC29_DMA8IP_LENGTH                     0x00000003

#define _IPC29_DMA9IP_POSITION                   0x0000000C
#define _IPC29_DMA9IP_MASK                       0x00007000
#define _IPC29_DMA9IP_LENGTH                     0x00000003

#define _IPC29_DMA8IP0_POSITION                  0x00000008
#define _IPC29_DMA8IP0_MASK                      0x00000100
#define _IPC29_DMA8IP0_LENGTH                    0x00000001

#define _IPC29_DMA8IP1_POSITION                  0x00000009
#define _IPC29_DMA8IP1_MASK                      0x00000200
#define _IPC29_DMA8IP1_LENGTH                    0x00000001

#define _IPC29_DMA8IP2_POSITION                  0x0000000A
#define _IPC29_DMA8IP2_MASK                      0x00000400
#define _IPC29_DMA8IP2_LENGTH                    0x00000001

#define _IPC29_DMA9IP0_POSITION                  0x0000000C
#define _IPC29_DMA9IP0_MASK                      0x00001000
#define _IPC29_DMA9IP0_LENGTH                    0x00000001

#define _IPC29_DMA9IP1_POSITION                  0x0000000D
#define _IPC29_DMA9IP1_MASK                      0x00002000
#define _IPC29_DMA9IP1_LENGTH                    0x00000001

#define _IPC29_DMA9IP2_POSITION                  0x0000000E
#define _IPC29_DMA9IP2_MASK                      0x00004000
#define _IPC29_DMA9IP2_LENGTH                    0x00000001

#define _IPC30_DMA10IP_POSITION                  0x00000000
#define _IPC30_DMA10IP_MASK                      0x00000007
#define _IPC30_DMA10IP_LENGTH                    0x00000003

#define _IPC30_DMA11IP_POSITION                  0x00000004
#define _IPC30_DMA11IP_MASK                      0x00000070
#define _IPC30_DMA11IP_LENGTH                    0x00000003

#define _IPC30_SPI4EIP_POSITION                  0x00000008
#define _IPC30_SPI4EIP_MASK                      0x00000700
#define _IPC30_SPI4EIP_LENGTH                    0x00000003

#define _IPC30_SPI4IP_POSITION                   0x0000000C
#define _IPC30_SPI4IP_MASK                       0x00007000
#define _IPC30_SPI4IP_LENGTH                     0x00000003

#define _IPC30_DMA10IP0_POSITION                 0x00000000
#define _IPC30_DMA10IP0_MASK                     0x00000001
#define _IPC30_DMA10IP0_LENGTH                   0x00000001

#define _IPC30_DMA10IP1_POSITION                 0x00000001
#define _IPC30_DMA10IP1_MASK                     0x00000002
#define _IPC30_DMA10IP1_LENGTH                   0x00000001

