MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU814/mcu.h
#define _OC9CON1_OCFLT1_POSITION                 0x00000005
#define _OC9CON1_OCFLT1_MASK                     0x00000020
#define _OC9CON1_OCFLT1_LENGTH                   0x00000001

#define _OC9CON1_OCFLT2_POSITION                 0x00000006
#define _OC9CON1_OCFLT2_MASK                     0x00000040
#define _OC9CON1_OCFLT2_LENGTH                   0x00000001

#define _OC9CON1_ENFLT0_POSITION                 0x00000007
#define _OC9CON1_ENFLT0_MASK                     0x00000080
#define _OC9CON1_ENFLT0_LENGTH                   0x00000001

#define _OC9CON1_ENFLT1_POSITION                 0x00000008
#define _OC9CON1_ENFLT1_MASK                     0x00000100
#define _OC9CON1_ENFLT1_LENGTH                   0x00000001

#define _OC9CON1_ENFLT2_POSITION                 0x00000009
#define _OC9CON1_ENFLT2_MASK                     0x00000200
#define _OC9CON1_ENFLT2_LENGTH                   0x00000001

#define _OC9CON2_SYNCSEL_POSITION                0x00000000
#define _OC9CON2_SYNCSEL_MASK                    0x0000001F
#define _OC9CON2_SYNCSEL_LENGTH                  0x00000005

#define _OC9CON2_OCTRIS_POSITION                 0x00000005
#define _OC9CON2_OCTRIS_MASK                     0x00000020
#define _OC9CON2_OCTRIS_LENGTH                   0x00000001

#define _OC9CON2_TRIGSTAT_POSITION               0x00000006
#define _OC9CON2_TRIGSTAT_MASK                   0x00000040
#define _OC9CON2_TRIGSTAT_LENGTH                 0x00000001

#define _OC9CON2_OCTRIG_POSITION                 0x00000007
#define _OC9CON2_OCTRIG_MASK                     0x00000080
#define _OC9CON2_OCTRIG_LENGTH                   0x00000001

#define _OC9CON2_OC32_POSITION                   0x00000008
#define _OC9CON2_OC32_MASK                       0x00000100
#define _OC9CON2_OC32_LENGTH                     0x00000001

#define _OC9CON2_OCINV_POSITION                  0x0000000C
#define _OC9CON2_OCINV_MASK                      0x00001000
#define _OC9CON2_OCINV_LENGTH                    0x00000001

#define _OC9CON2_FLTTRIEN_POSITION               0x0000000D
#define _OC9CON2_FLTTRIEN_MASK                   0x00002000
#define _OC9CON2_FLTTRIEN_LENGTH                 0x00000001

#define _OC9CON2_FLTOUT_POSITION                 0x0000000E
#define _OC9CON2_FLTOUT_MASK                     0x00004000
#define _OC9CON2_FLTOUT_LENGTH                   0x00000001

#define _OC9CON2_FLTMD_POSITION                  0x0000000F
#define _OC9CON2_FLTMD_MASK                      0x00008000
#define _OC9CON2_FLTMD_LENGTH                    0x00000001

#define _OC9CON2_SYNCSEL0_POSITION               0x00000000
#define _OC9CON2_SYNCSEL0_MASK                   0x00000001
#define _OC9CON2_SYNCSEL0_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL1_POSITION               0x00000001
#define _OC9CON2_SYNCSEL1_MASK                   0x00000002
#define _OC9CON2_SYNCSEL1_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL2_POSITION               0x00000002
#define _OC9CON2_SYNCSEL2_MASK                   0x00000004
#define _OC9CON2_SYNCSEL2_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL3_POSITION               0x00000003
#define _OC9CON2_SYNCSEL3_MASK                   0x00000008
#define _OC9CON2_SYNCSEL3_LENGTH                 0x00000001

#define _OC9CON2_SYNCSEL4_POSITION               0x00000004
#define _OC9CON2_SYNCSEL4_MASK                   0x00000010
#define _OC9CON2_SYNCSEL4_LENGTH                 0x00000001

#define _OC9CON2_FLTMODE_POSITION                0x0000000E
#define _OC9CON2_FLTMODE_MASK                    0x00004000
#define _OC9CON2_FLTMODE_LENGTH                  0x00000001

#define _OC10CON1_OCM_POSITION                   0x00000000
#define _OC10CON1_OCM_MASK                       0x00000007
#define _OC10CON1_OCM_LENGTH                     0x00000003

#define _OC10CON1_TRIGMODE_POSITION              0x00000003
#define _OC10CON1_TRIGMODE_MASK                  0x00000008
#define _OC10CON1_TRIGMODE_LENGTH                0x00000001

#define _OC10CON1_OCFLTA_POSITION                0x00000004
#define _OC10CON1_OCFLTA_MASK                    0x00000010
#define _OC10CON1_OCFLTA_LENGTH                  0x00000001

#define _OC10CON1_OCFLTB_POSITION                0x00000005
#define _OC10CON1_OCFLTB_MASK                    0x00000020
#define _OC10CON1_OCFLTB_LENGTH                  0x00000001

#define _OC10CON1_OCFLTC_POSITION                0x00000006
#define _OC10CON1_OCFLTC_MASK                    0x00000040
#define _OC10CON1_OCFLTC_LENGTH                  0x00000001

#define _OC10CON1_ENFLTA_POSITION                0x00000007
#define _OC10CON1_ENFLTA_MASK                    0x00000080
#define _OC10CON1_ENFLTA_LENGTH                  0x00000001

#define _OC10CON1_ENFLTB_POSITION                0x00000008
#define _OC10CON1_ENFLTB_MASK                    0x00000100
#define _OC10CON1_ENFLTB_LENGTH                  0x00000001

#define _OC10CON1_ENFLTC_POSITION                0x00000009
#define _OC10CON1_ENFLTC_MASK                    0x00000200
#define _OC10CON1_ENFLTC_LENGTH                  0x00000001

#define _OC10CON1_OCTSEL_POSITION                0x0000000A
#define _OC10CON1_OCTSEL_MASK                    0x00001C00
#define _OC10CON1_OCTSEL_LENGTH                  0x00000003

#define _OC10CON1_OCSIDL_POSITION                0x0000000D
#define _OC10CON1_OCSIDL_MASK                    0x00002000
#define _OC10CON1_OCSIDL_LENGTH                  0x00000001

#define _OC10CON1_OCM0_POSITION                  0x00000000
#define _OC10CON1_OCM0_MASK                      0x00000001
#define _OC10CON1_OCM0_LENGTH                    0x00000001

#define _OC10CON1_OCM1_POSITION                  0x00000001
#define _OC10CON1_OCM1_MASK                      0x00000002
#define _OC10CON1_OCM1_LENGTH                    0x00000001

#define _OC10CON1_OCM2_POSITION                  0x00000002
#define _OC10CON1_OCM2_MASK                      0x00000004
#define _OC10CON1_OCM2_LENGTH                    0x00000001

#define _OC10CON1_OCFLT_POSITION                 0x00000004
#define _OC10CON1_OCFLT_MASK                     0x00000070
#define _OC10CON1_OCFLT_LENGTH                   0x00000003

